In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

In [2]:
df_tips = sns.load_dataset("tips")

In [5]:
df_tips.head(10)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4
5       25.29  4.71    Male     No  Sun  Dinner     4
6        8.77  2.00    Male     No  Sun  Dinner     2
7       26.88  3.12    Male     No  Sun  Dinner     4
8       15.04  1.96    Male     No  Sun  Dinner     2
9       14.78  3.23    Male     No  Sun  Dinner     2

In [34]:
tip_by_sex = df_tips.groupby(["sex"])["tip"].mean()

In [35]:
tip_by_sex = tip_by_sex.reset_index()

In [36]:
tip_by_sex

      sex       tip
0    Male  3.089618
1  Female  2.833448

In [26]:
tip_by_sex

      sex       tip
0    Male  3.089618
1  Female  2.833448

In [27]:
#Re arrenge and rename columns Df
tip_by_sex = tip_by_sex.rename(columns = {tip_by_sex.columns[1]: "Average Tip"})

In [28]:
tip_by_sex

      sex  Average Tip
0    Male     3.089618
1  Female     2.833448

In [39]:
#diferencia smoker / non smoker 
tip_by_sex = df_tips.groupby(["sex","smoker"])["tip"].mean()

In [40]:
tip_by_sex

sex     smoker
Male    Yes       3.051167
        No        3.113402
Female  Yes       2.931515
        No        2.773519
Name: tip, dtype: float64

In [41]:
tip_by_sex = tip_by_sex.reset_index()

In [42]:
tip_by_sex

      sex smoker       tip
0    Male    Yes  3.051167
1    Male     No  3.113402
2  Female    Yes  2.931515
3  Female     No  2.773519

In [43]:
#Re arrenge and rename columns Df
tip_by_sex = tip_by_sex.rename(columns = {tip_by_sex.columns[2]: "Average Tip"})

In [44]:
tip_by_sex

      sex smoker  Average Tip
0    Male    Yes     3.051167
1    Male     No     3.113402
2  Female    Yes     2.931515
3  Female     No     2.773519

In [46]:
#crosstab : para contar el numero de veces que pasa una instancia, por ejemplo cuantos son mujeres, cuantos hombres? fumadores o no?
df_tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [50]:
this =pd.crosstab(columns = df_tips["sex"], index = df_tips["smoker"])

In [51]:
this

sex     Male  Female
smoker
Yes       60      33
No        97      54

In [60]:
this = pd.crosstab(columns = df_tips["sex"], index = [df_tips["smoker"],df_tips["day"],df_tips["time"]]).rename_axis(None, axis=1)

In [61]:
this

                    Male  Female
smoker day  time
Yes    Thur Lunch     10       7
       Fri  Lunch      3       3
            Dinner     5       4
       Sat  Dinner    27      15
       Sun  Dinner    15       4
No     Thur Lunch     20      24
            Dinner     0       1
       Fri  Lunch      0       1
            Dinner     2       1
       Sat  Dinner    32      13
       Sun  Dinner    43      14